taskt/Core/Automation/Commands/ListGroup/IListResultProperties.dot
digraph "taskt.Core.Automation.Commands.IListResultProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.IListResultProperties" [ label="IListResultProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IResultProperties" [ label="IResultProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ICanHandleList" [ label="ICanHandleList", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExpandableProperties" [ label="IExpandableProperties", shape="ellipse", style="dashed", ];

"taskt.Core.Automation.Commands.IListResultProperties" -> "taskt.Core.Automation.Commands.IResultProperties";
"taskt.Core.Automation.Commands.IListResultProperties" -> "taskt.Core.Automation.Commands.ICanHandleList";
"taskt.Core.Automation.Commands.ICanHandleList" -> "taskt.Core.Automation.Commands.IExpandableProperties";
}
